{"text_input": "I feel anxious about public speaking. My heart races and my mind goes blank.", "output": "It's common to feel this way. Let's work on deep breathing exercises to calm your mind. You might also benefit from gradually practicing in safe settings."}
{"text_input": "I constantly worry about things I can’t control. It’s exhausting.", "output": "Overthinking can drain your energy. Journaling to release your thoughts and practicing mindfulness can help you refocus on the present."}
{"text_input": "I feel stressed all the time at work. I can’t focus anymore.", "output": "Work stress can be overwhelming. Let’s explore time management strategies and ways to set boundaries to protect your mental energy."}
{"text_input": "I have social anxiety and avoid gatherings because they make me feel uneasy.", "output": "Social anxiety is tough. Start by attending smaller gatherings or practicing exposure to social situations in low-pressure environments."}
{"text_input": "I don’t feel like getting out of bed anymore. Everything feels pointless.", "output": "These feelings of hopelessness can be overwhelming. Let’s start small—like setting a daily routine and engaging in activities you used to enjoy."}
{"text_input": "I feel numb and disconnected from everyone.", "output": "Feeling numb often signals emotional overload. Connecting with supportive people or engaging in physical activities might help reignite some feelings of connection."}
{"text_input": "I feel like nobody would care if I disappeared.", "output": "You are valuable, and your feelings matter. Let’s focus on building a support system and exploring what brings you moments of joy."}
{"text_input": "Nothing I do seems to make me happy anymore.", "output": "Let’s identify activities you used to enjoy and start incorporating small steps to re-engage with them. Talking about your emotions may also help."}
{"text_input": "I keep having arguments with my partner about small things.", "output": "Miscommunication often causes these conflicts. Let's work on using 'I feel' statements and listening actively to each other."}
{"text_input": "I feel like my partner doesn’t understand me anymore.", "output": "It sounds like you’re feeling unseen. How about scheduling uninterrupted time to talk and reconnect? Exploring shared activities could also help."}
{"text_input": "I don’t feel close to my family anymore.", "output": "Relationships can ebb and flow. Let’s explore how you can reconnect through honest communication or shared experiences."}
{"text_input": "I feel like my friends are excluding me. It hurts.", "output": "It’s hard to feel left out. Let’s talk about how to address this with your friends and focus on building supportive relationships."}
{"text_input": "I recently moved to a new city, and I feel lonely and lost.", "output": "Adjusting to a new place is tough. Joining local clubs or online groups can help you make connections."}
{"text_input": "Becoming a parent has been overwhelming. I feel like I’m not doing enough.", "output": "Parenting is a major adjustment. Remember, you're doing your best. Let’s identify small, manageable routines to ease your transition."}
{"text_input": "I just started a new job, and I feel like I’m not good enough.", "output": "Impostor syndrome is common in new roles. Let’s focus on the strengths that got you this job and celebrate small victories."}
{"text_input": "I feel overwhelmed by all the responsibilities I have now.", "output": "Taking on too much can be exhausting. Let’s prioritize tasks and identify areas where you can ask for help."}
{"text_input": "I can’t stop thinking about a traumatic event from my past.", "output": "Revisiting trauma can be distressing. Grounding exercises can help. When you're ready, we can explore these memories gently to reduce their emotional impact."}
{"text_input": "I lost a loved one and feel like I’ll never recover.", "output": "Grief is a unique journey. Let’s talk about your loved one and explore ways to honor their memory while finding steps forward."}
{"text_input": "I have nightmares about something that happened years ago.", "output": "Nightmares can be linked to unresolved feelings. Journaling or relaxation techniques before bed may help, and we can work on processing the event in sessions."}
{"text_input": "I feel like my past is haunting me, and I can’t escape it.", "output": "Healing takes time. Let’s start by acknowledging the strength it took to get here and building tools to help you feel safer in the present."}
{"text_input": "I don’t feel confident in anything I do.", "output": "Low confidence can be worked on by recognizing small achievements. Let’s identify what you value and build affirmations based on your strengths."}
{"text_input": "I don’t know who I am anymore.", "output": "Identity exploration is a courageous step. Journaling about what brings you joy and reflecting on meaningful moments could offer clarity."}
{"text_input": "I feel like I’m always comparing myself to others.", "output": "Comparison is a natural but often unhelpful habit. Let’s focus on celebrating your unique journey and setting personal goals."}
{"text_input": "I don’t feel attractive or worthy of love.", "output": "It’s important to nurture self-compassion. Let’s explore ways to challenge these thoughts and focus on the qualities that make you special."}
{"text_input": "I feel completely burned out from work.", "output": "Burnout is serious. Prioritize self-care and setting boundaries. Can you identify tasks to delegate or times to unplug from work?"}
{"text_input": "I’m overwhelmed with balancing work and family responsibilities.", "output": "Let’s break down your responsibilities into smaller tasks. Creating a schedule with 'me time' might also help relieve stress."}
{"text_input": "I can’t handle uncertainty about my future.", "output": "The unknown can feel daunting. Practicing mindfulness and focusing on what you can control today might ease this anxiety."}
{"text_input": "I always feel like I need to be perfect.", "output": "Perfectionism is tough. Let’s focus on celebrating progress rather than results and challenging the idea that mistakes define your worth."}
